W9D2/art_share_d2/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "New Artwork"], ["image_url", "Some URL"], ["artist_id", 4]]
---
    def create
        artwork = Artwork.new(artwork_params)
        # debugger
        if artwork.save