W9D2/art_share_d2/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the Index Action"
        users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "trevor"], ["email", "up@tain.com"]]

    def update
        user = User.find(params[:id])
        user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "valid_name"], ["id", 2]]