W10D4/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @sub = Sub.find(params[:id]) #init mod id =4

SELECT  "subs".* FROM "subs" WHERE "subs"."moderator_id" = $1 LIMIT $2  [["moderator_id", 10], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Something"], ["description", "something"], ["updated_at", "2019-12-20 00:21:40.991186"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(moderator_id: current_user.id)
        @sub.update_attributes(sub_params)